import floating1 from "../images/floating/1.JPG";
import floating2 from "../images/floating/2.JPG";
import image1 from "../images/1.JPG";
import image2 from "../images/2.JPG";
import image3 from "../images/3.JPG";
import image4 from "../images/4.JPG";
import image5 from "../images/5.JPG";
import image6 from "../images/6.JPG";
import image7 from "../images/7.JPG";
import gift1 from "../images/gifts/1.JPG";
import gift2 from "../images/gifts/2.JPG";
import gift3 from "../images/gifts/3.JPG";
import gift4 from "../images/gifts/4.JPG";
import gift5 from "../images/gifts/5.JPG";
import star from "../star.svg";

export const _floatingImageFirst = floating1;
export const _floatingImageSecond = floating2;

export const _albums = [image1, image2, image3, image4, image5, image6, image7];

export const giftAlbums = [gift1, gift2, gift3, gift4, gift5];

export const _stars = [
    {
        src: star,
        color: "#ffccd7",
        size: "12",
    },
    {
        src: star,
        color: "#ffccd7",
        size: "4",
    },
];
// ก่อน memories
// "วันนี้เป็นวันพิเศษของหนูพี่ตั้งใจทำสิ่งนี้ขึ้นมา มันอาจจะไม่ได้เป็นอะไรที่ซับซ้อนหรือยิ่งใหญ่ แต่พี่อยากให้มันมาจากใจจริงๆ",
//     "การทำสิ่งนี้ให้หนูมันทำให้พี่นึกถึงทุกช่วงเวลาที่เราได้ใช้ร่วมกัน ไม่ว่าจะเป็นเรื่องเล็กๆ หรือเรื่องใหญ่ๆ หนูทำให้เรารู้สึกว่าชีวิตพี่มีความหมายมากขึ้นทุกวัน",
//     "พี่เลยคิดว่า ถ้าจะทำอะไรให้หนูในวันพิเศษนี้ พี่ก็อยากจะทำให้มันเป็นสิ่งที่ทำให้หนูยิ้มได้ และรู้สึกดี ถึงแม้พี่จะไม่เก่งเรื่องคำพูดหวานๆ แต่พี่อยากบอกว่าหนูมีความหมายกับพี่มากแค่ไหน",
//     "พี่หวังว่าหนูจะมีความสุขในวันเกิดนี้มากๆเว็บนี้จะเป็นกระบอกเสียงแทนความรู้สึกใจในของพี่นะครับ"

// หลังกดรหัส Memories
// "สุขสันต์วันเกิดนะครับเจ้าแมวน้อย!",
//     "วันนี้เป็นวันที่พิเศษสำหรับพี่มากๆเลย",
//     "ขอบคุณสำหรับทุกสิ่งที่หนูทำให้ ทุกความรู้สึกดีๆ ที่เรามีร่วมกัน ไม่ว่าจะเป็นวันธรรมดาหรือวันที่เราผ่านเรื่องยากๆ มาด้วยกัน",
//     "หนูทำให้พี่รู้สึกว่า “โชคดีมาก” ที่พี่กับหนูได้อยู่ด้วยกัน และไม่ว่าจะเจออุปสรรคอะไรพี่ก็คิดว่าหนูต้องผ่านไปได้ด้วยดีแน่นอน หนูก็ยังมีพี่เป็นพลังใจให้เสมอ มีปัญหาอะไรก็บอกพี่ได้เสมอเลย และพี่อยากให้ปีนี้เป็นปีที่เต็มไปด้วยความสุข ความสมหวังในทุกสิ่งที่หนูตั้งใจ",
//     "ขอให้ทุกความฝันของหนูเป็นจริง และพี่จะอยู่ข้างหนูเสมอ ในทุกความสำเร็จ พี่ดีใจมากๆที่ได้เป็นส่วนหนึ่งในชีวิตของหนู
// พี่รักหนูที่สุดเลยนะครับ",
//     "สุขสันต์วันเกิดอีกครั้งนะครับ"

export const _messages = [
    "วันนี้เป็นวันพิเศษของหนูพี่ตั้งใจทำสิ่งนี้ขึ้นมา มันอาจจะไม่ได้เป็นอะไรที่ซับซ้อนหรือยิ่งใหญ่ แต่พี่อยากให้มันมาจากใจจริงๆ",
    "การทำสิ่งนี้ให้หนูมันทำให้พี่นึกถึงทุกช่วงเวลาที่เราได้ใช้ร่วมกัน ไม่ว่าจะเป็นเรื่องเล็กๆ หรือเรื่องใหญ่ๆ หนูทำให้เรารู้สึกว่าชีวิตพี่มีความหมายมากขึ้นทุกวัน",
    "พี่เลยคิดว่า ถ้าจะทำอะไรให้หนูในวันพิเศษนี้ พี่ก็อยากจะทำให้มันเป็นสิ่งที่ทำให้หนูยิ้มได้ และรู้สึกดี ถึงแม้พี่จะไม่เก่งเรื่องคำพูดหวานๆ แต่พี่อยากบอกว่าหนูมีความหมายกับพี่มากแค่ไหน",
    "พี่หวังว่าหนูจะมีความสุขในวันเกิดนี้มากๆเว็บนี้จะเป็นกระบอกเสียงแทนความรู้สึกใจในของพี่นะครับ",
];

export const _birthdayMessages = [
    "สุขสันต์วันเกิดนะครับเจ้าแมวน้อย!",
    "วันนี้เป็นวันที่พิเศษสำหรับพี่มากๆเลย",
    "ขอบคุณสำหรับทุกสิ่งที่หนูทำให้ ทุกความรู้สึกดีๆ ที่เรามีร่วมกัน ไม่ว่าจะเป็นวันธรรมดาหรือวันที่เราผ่านเรื่องยากๆ มาด้วยกัน",
    "หนูทำให้พี่รู้สึกว่า “โชคดีมาก” ที่พี่กับหนูได้อยู่ด้วยกัน และไม่ว่าจะเจออุปสรรคอะไรพี่ก็คิดว่าหนูต้องผ่านไปได้ด้วยดีแน่นอน หนูก็ยังมีพี่เป็นพลังใจให้เสมอ มีปัญหาอะไรก็บอกพี่ได้เสมอเลย และพี่อยากให้ปีนี้เป็นปีที่เต็มไปด้วยความสุข ความสมหวังในทุกสิ่งที่หนูตั้งใจ",
    "ขอให้ทุกความฝันของหนูเป็นจริง และพี่จะอยู่ข้างหนูเสมอ ในทุกความสำเร็จ พี่ดีใจมากๆที่ได้เป็นส่วนหนึ่งในชีวิตของหนู",
    "พี่รักหนูที่สุดเลยนะครับ",
    "สุขสันต์วันเกิดอีกครั้งนะครับ",
];

// เอาแค่ code ของคลิปมาใส่ หลัง https://www.youtube.com/embed/ เช่น https://youtube.com/shorts/equ0y9yuLYk จะใช้แค่ equ0y9yuLYk
// https://www.youtube.com/embed/equ0y9yuLYk
export const _youtubeUrl = "https://www.youtube.com/embed/a_1UjOIAHQo";

export const _otp = "nadia";
